<template>
  <div class="box">
    <div class="nav">
      <van-icon @click="fh()" class="nav-left" name="arrow-left" size="0.5rem" />
      <p>用户注册协议</p>
    </div>
    <div class="concat">
      <p style="text-indent:2em;">
        尊敬的客户，欢迎您注册成为本平台用户。在注册前请您仔细阅读如下服务条款：
        本服务协议双方为本平台与本平台客户，本服务协议具有合同效力。您确认本服务协议后，本服务协议即在您和本平台之间产生法律效力。请您务必在注册之前认真阅读全部服务协议内容，如有任何疑问，可向本平台咨询。 无论您事实上是否在注册之前认真阅读了本服务协议，只要按照本平台注册程序成功注册为用户，您的行为仍然表示您同意并签署了本服务协议。
      </p>
      <div>协议细则</div>
      <div>
        1、平台服务条款的确认和接纳
        <p>
          (1) 本协议的订立、执行和解释及争议的解决均应适用中华人民共和国法律。
          <br />(2) 如本协议中的任何条款无论因何种原因完全或部分无效或不具有执行力，本协议的其余条款仍应有效并且有约束力。
          <br />(3) 本协议解释权及修订权归河南源领网络科技有限公司所有。
        </p>
      </div>
      <div>
        2、用户必须
        <p>
          (1)自行配备上网的所需设备， 包括个人电脑、调制解调器或其他必备上网装置。
          <br />(2)自行负担个人上网所支付的与此服务有关的电话费用、 网络费用。
        </p>
      </div>
      <div>
        3、用户在平台上不得发布下列违法信息：
        <p>
          (1)反对宪法所确定的基本原则的；
          <br />(2)危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；
          <br />(3)损害国家荣誉和利益的；
          <br />(4)煽动民族仇恨、民族歧视，破坏民族团结的；
          <br />(5)破坏国家宗教政策，宣扬邪教和封建迷信的；
          <br />(6)散布谣言，扰乱社会秩序，破坏社会稳定的；
          <br />(7)散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；
          <br />(8)侮辱或者诽谤他人，侵害他人合法权益的；
          <br />(9)含有法律、行政法规禁止的其他内容的。
        </p>
      </div>
      <div>
        2、用户必须
        <p>
          (1)自行配备上网的所需设备， 包括个人电脑、调制解调器或其他必备上网装置。
          <br />(2)自行负担个人上网所支付的与此服务有关的电话费用、 网络费用。
          <br />
        </p>
      </div>
      <div>
        4、有关个人资料
        <p>
          (1) 用户同意、提供及时、详尽及准确的个人资料。
          <br />(2).同意接收来自本平台的信息。
          <br />(3) 不断更新注册资料，符合及时、详尽准确的要求。所有原始键入的资料将引用为注册资料。
        </p>
      </div>
      <div>
        5、服务条款的修改
        <p>本平台有权在必要时修改服务条款，用户应当及时关注并同意本站不承担通知义务。如果不同意所改动的内容，用户可以主动取消获得的本平台信息服务。如果用户继续享用本平台信息服务，则视为接受服务条款的变动。本平台保留随时修改或中断服务而不需通知用户的权利。本平台行使修改或中断服务的权利，不需对用户或第三方负责。</p>
      </div>
      <div>
        6、用户的帐号、密码和安全性
        <p>你一旦注册成功成为用户，你将得到一个密码和帐号。如果你不保管好自己的帐号和密码安全，将负全部责任。另外，每个用户都要对其帐户中的所有活动和事件负全责。你可随时根据指示改变你的密码，也可以结束旧的帐户重开一个新帐户。用户同意若发现任何非法使用用户帐号或安全漏洞的情况，请立即通知本平台。</p>
      </div>
      <div>
        7、拒绝提供担保
        <p>用户明确同意信息服务的使用由用户个人承担风险。本平台不担保服务不会受中断，对服务的及时性，安全性，出错发生都不作担保，但会在能力范围内，避免出错。</p>
      </div>
      <div>
        8、有限责任
        <p>本平台对任何直接、间接、偶然、特殊及继起的损害不负责任，这些损害来自：不正当使用本平台服务，或用户传送的信息不符合规定等。这些行为都有可能导致本平台形象受损，所以本平台事先提出这种损害的可能性，同时会尽量避免这种损害的发生。</p>
      </div>
      <div>
        9、信息的储存及限制
        <p>本平台有判定用户的行为是否符合本平台服务条款的要求和精神的权利，如果用户违背本平台服务条款的规定，本平台有权中断其服务的帐号。</p>
      </div>
      <div>
        10、用户管理
        <p>
          用户必须遵循：
          <br />(1) 使用信息服务不作非法用途。
          <br />(2) 不干扰或混乱网络服务。
          <br />(3) 遵守所有使用服务的网络协议、规定、程序和惯例。用户的行为准则是以因特网法规，政策、程序和惯例为根据的。
        </p>
      </div>
      <div>
        11、保障
        <p>用户同意保障和维护本平台全体成员的利益，负责支付由用户使用超出服务范围引起的律师费用，违反服务条款的损害补偿费用，其它人使用用户的电脑、帐号和其它知识产权的追索费。</p>
      </div>
      <div>
        12、结束服务
        <p>
          用户或本平台可随时根据实际情况中断一项或多项服务。本平台不需对任何个人或第三方负责而随时中断服务。用户若反对任何服务条款的建议或对后来的条款修改有异议，或对本平台服务不满，用户可以行使如下权利：
          <br />(1) 不再使用本平台信息服务。
          <br />(2) 通知本平台停止对该用户的服务。
          <br />结束用户服务后，用户使用本平台服务的权利马上中止。从那时起，用户没有权利，本平台也没有义务传送任何未处理的信息或未完成的服务给用户或第三方。
        </p>
      </div>
      <div>
        13、通告
        <p>所有发给用户的通告都可通过重要页面的公告或电子邮件或常规的信件传送。服务条款的修改、服务变更、或其它重要事件的通告都会以此形式进行。</p>
      </div>
      <div>
        14、信息内容的所有权
        <p>本平台定义的信息内容包括：文字、软件、声音、相片、录象、图表；在广告中全部内容；本平台为用户提供的其它信息。所有这些内容受版权、商标、标签和其它财产所有权法律的保护。所以，用户只能在本平台和广告商授权下才能使用这些内容，而不能擅自复制、再造这些内容、或创造与内容有关的派生产品。</p>
      </div>
    </div>
  </div>
</template>

<script>
export default {
  name: "Helpp",
  data() {
    return {};
  },
  methods: {
    fh() {
      this.$router.go(-1);
    }
  }
};
</script>

<style scoped>
.box {
  width: 100%;
  height: 100vh;
  background: #ffffff;
  position: relative;
}

.nav {
  width: 100%;
  height: 0.88rem;
  background: #ffffff;
  line-height: 0.88rem;
  text-align: center;
  position: relative;
  border-bottom: 1px solid #f7f7f7;
}

.nav p {
  font-size: 0.36rem;
  font-weight: 500;
  color: rgba(51, 51, 51, 1);
}
.nav-left {
  position: absolute;
  left: 0.25rem;
  top: 0.2rem;
}

.concat {
  width: 6.9rem;
  padding: 0.3rem;
  text-align: left;
  font-size: 0.28rem;
}
.concat div {
  margin: 0.1rem 0;
}
.concat div p {
  margin: 0.1rem 0;
  padding-left: 0.45rem;
}
</style>
